Results/postgresql/load-target-200-2.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.JdbcDBClient -P /root/ycsb/config/postgresql.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
Adding shard node URL: jdbc:postgresql://vmpg3:5432/ycsb
[...]
Using 1 shards
Using 1 shards
Using 1 shards
[...]
 10 sec: 5668 operations; 564.71 current ops/sec;  
 20 sec: 11803 operations; 613.13 current ops/sec;  
 30 sec: 17904 operations; 610.1 current ops/sec;  
 40 sec: 23167 operations; 526.25 current ops/sec;  
 50 sec: 29220 operations; 605.24 current ops/sec;  
 60 sec: 35026 operations; 580.54 current ops/sec;  
 70 sec: 39559 operations; 453.21 current ops/sec;  
 80 sec: 45389 operations; 583 current ops/sec;  
 90 sec: 51297 operations; 590.74 current ops/sec;  
 100 sec: 56661 operations; 536.35 current ops/sec;  
 110 sec: 61596 operations; 493.45 current ops/sec;  
 120 sec: 67066 operations; 546.95 current ops/sec;  
 130 sec: 72603 operations; 553.64 current ops/sec;  
 140 sec: 77987 operations; 538.35 current ops/sec;  
 150 sec: 84060 operations; 607.24 current ops/sec;  
 160 sec: 89125 operations; 506.45 current ops/sec;  
 170 sec: 94972 operations; 584.64 current ops/sec; [INSERT AverageLatency(us)=38918] 
 180 sec: 100711 operations; 573.84 current ops/sec;  
 190 sec: 106199 operations; 548.75 current ops/sec;  
 200 sec: 111759 operations; 555.94 current ops/sec;  
 210 sec: 117239 operations; 547.95 current ops/sec;  
 220 sec: 121910 operations; 467.01 current ops/sec;  
 230 sec: 127856 operations; 594.54 current ops/sec;  
 240 sec: 133770 operations; 591.34 current ops/sec;  
 250 sec: 139483 operations; 571.24 current ops/sec;  
 260 sec: 145071 operations; 558.74 current ops/sec;  
 270 sec: 151169 operations; 609.74 current ops/sec;  
 280 sec: 155381 operations; 421.16 current ops/sec;  
 290 sec: 161357 operations; 597.54 current ops/sec; [INSERT AverageLatency(us)=33259] 
 300 sec: 166780 operations; 542.25 current ops/sec;  
 310 sec: 172460 operations; 567.94 current ops/sec;  
 320 sec: 178095 operations; 563.44 current ops/sec;  
 330 sec: 182884 operations; 478.85 current ops/sec;  
 340 sec: 188040 operations; 515.55 current ops/sec;  
 350 sec: 192694 operations; 465.35 current ops/sec;  
 360 sec: 198814 operations; 611.94 current ops/sec;  
 370 sec: 204277 operations; 546.25 current ops/sec;  
 380 sec: 209977 operations; 569.83 current ops/sec;  
 390 sec: 216034 operations; 605.64 current ops/sec;  
 400 sec: 219370 operations; 333.57 current ops/sec;  
 410 sec: 224032 operations; 466.15 current ops/sec;  
 420 sec: 228022 operations; 398.96 current ops/sec;  
 430 sec: 233070 operations; 504.75 current ops/sec;  
 440 sec: 238838 operations; 576.74 current ops/sec;  
 450 sec: 244623 operations; 578.44 current ops/sec;  
 460 sec: 249145 operations; 452.15 current ops/sec;  
 470 sec: 254174 operations; 502.85 current ops/sec;  
 480 sec: 257739 operations; 356.5 current ops/sec;  
 490 sec: 263507 operations; 576.74 current ops/sec;  
 500 sec: 268424 operations; 491.65 current ops/sec;  
 510 sec: 273333 operations; 490.8 current ops/sec; [INSERT AverageLatency(us)=37495.67] 
 520 sec: 279256 operations; 592.18 current ops/sec;  
 530 sec: 284298 operations; 504.15 current ops/sec;  
 540 sec: 288725 operations; 442.66 current ops/sec;  
 550 sec: 293600 operations; 487.45 current ops/sec;   
 560 sec: 298359 operations; 475.85 current ops/sec;   
 567 sec: 300000 operations; 221.28 current ops/sec;   
[OVERALL], RunTime(ms), 567516.0
[OVERALL], Throughput(ops/sec), 528.6194574249889
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 56159.77830666667
[INSERT], MinLatency(us), 17278
[INSERT], MaxLatency(us), 3506314
[INSERT], Return=0, 299983
[INSERT], 0, 70678.26829268293
[INSERT], 1000, 67008.26378896882
[INSERT], 2000, 51783.741721854305
[INSERT], 3000, 40684.32191780822
[INSERT], 4000, 44738.32740740741
[INSERT], 5000, 58406.479452054795
[INSERT], 6000, 60422.81799591002
[INSERT], 7000, 44833.00442477876
[INSERT], 8000, 40979.82943603851
[INSERT], 9000, 39357.2374005305
[INSERT], 10000, 49631.12080536913
[INSERT], 11000, 50096.58843537415
[INSERT], 12000, 46287.86943164362
[INSERT], 13000, 47309.05108359133
[INSERT], 14000, 67135.63656884876
[INSERT], 15000, 47218.093247588426
[INSERT], 16000, 48834.515923566876
[INSERT], 17000, 45567.075500770414
[INSERT], 18000, 54513.192170818504
[INSERT], 19000, 48370.884430176564
[INSERT], 20000, 39893.4984984985
[INSERT], 21000, 49540.58858858859
[INSERT], 22000, 41369.98484848485
[INSERT], 23000, 56169.19542619542
[INSERT], 24000, 71019.72570194384
[INSERT], 25000, 39573.8437917223
[INSERT], 26000, 50013.07202680067
[INSERT], 27000, 53968.98596491228
[INSERT], 28000, 47545.81511254019
[INSERT], 29000, 54437.59212880143
[INSERT], 30000, 53455.246402877696
[INSERT], 31000, 50913.89473684211
[INSERT], 32000, 69497.20652173914
[INSERT], 33000, 47689.37459807074
[INSERT], 34000, 123266.47872340426
[INSERT], 35000, 65714.1642599278
[INSERT], 36000, 54220.06989247312
[INSERT], 37000, 57311.75521821632
[INSERT], 38000, 45044.010606060605
[INSERT], 39000, 48909.70398481973
[INSERT], 40000, 49909.545454545456
[INSERT], 41000, 40233.02390438247
[INSERT], 42000, 45673.214397496085
[INSERT], 43000, 57390.574669187146
[INSERT], 44000, 67537.26351351352
[INSERT], 45000, 47328.0375
[INSERT], 46000, 42770.41234221599
[INSERT], 47000, 38148.59259259259
[INSERT], 48000, 46626.255250403876
[INSERT], 49000, 83679.20643431635
[INSERT], 50000, 54976.40075614367
[INSERT], 51000, 56191.90148698885
[INSERT], 52000, 43642.12
[INSERT], 53000, 90349.85869565218
[INSERT], 54000, 47610.43664122137
[INSERT], 55000, 46974.58795562599
[INSERT], 56000, 44540.07874015748
[INSERT], 57000, 54752.77385159011
[INSERT], 58000, 46149.55235204856
[INSERT], 59000, 50157.801268498944
[INSERT], 60000, 69431.4
[INSERT], 61000, 48605.56168831169
[INSERT], 62000, 55240.83121597096
[INSERT], 63000, 77017.71929824562
[INSERT], 64000, 73212.03294117647
[INSERT], 65000, 114389.39711191336
[INSERT], 66000, 53629.855633802814
[INSERT], 67000, 54999.546788990825
[INSERT], 68000, 84681.86337209302
[INSERT], 69000, 77329.67171717172
[INSERT], 70000, 48809.940609951846
[INSERT], 71000, 44128.546407185626
[INSERT], 72000, 49678.705192629815
[INSERT], 73000, 61493.21513944223
[INSERT], 74000, 49799.31658291457
[INSERT], 75000, 46116.00766871166
[INSERT], 76000, 40289.748
[INSERT], 77000, 105249.25089605735
[INSERT], 78000, 51138.57191201354
[INSERT], 79000, 69617.52983293556
[INSERT], 80000, 42614.88137931035
[INSERT], 81000, 40717.10975609756
[INSERT], 82000, 42725.96371552975
[INSERT], 83000, 113939.99190283401
[INSERT], 84000, 62565.19038076152
[INSERT], 85000, 61101.70481927711
[INSERT], 86000, 45010.35598227474
[INSERT], 87000, 41248.34163208852
[INSERT], 88000, 44157.22352941176
[INSERT], 89000, 58498.96887159533
[INSERT], 90000, 58092.319688109164
[INSERT], 91000, 43387.017316017314
[INSERT], 92000, 59349.25242718447
[INSERT], 93000, 56227.30056710775
[INSERT], 94000, 65050.75703324808
[INSERT], 95000, 112153.09061488674
[INSERT], 96000, 46551.867298578196
[INSERT], 97000, 48231.45602605863
[INSERT], 98000, 47578.954113924054
[INSERT], 99000, 60404.64833005894
[INSERT], 100000, 51534.46701388889
[INSERT], 101000, 50339.276948590385
[INSERT], 102000, 42825.83165467626
[INSERT], 103000, 39126.28793774319
[INSERT], 104000, 67792.14285714286
[INSERT], 105000, 129953.64897959183
[INSERT], 106000, 51204.7375
[INSERT], 107000, 60453.235701906415
[INSERT], 108000, 56320.997282608696
[INSERT], 109000, 356157.2727272727
[INSERT], 110000, 423757.31111111114
[INSERT], 111000, 55342.1743119266
[INSERT], 112000, 40886.661705006765
[INSERT], 113000, 45244.59208523592
[INSERT], 114000, 53373.91637010676
[INSERT], 115000, 51569.865051903114
[INSERT], 116000, 46586.606864274574
[INSERT], 117000, 40048.78289473684
[INSERT], 118000, 60078.44736842105
[INSERT], 119000, 41078.420612813374
[INSERT], 120000, 58938.208835341364
[INSERT], 121000, 45339.09384164223
[INSERT], 122000, 69725.82191780822
[INSERT], 123000, 48093.75986842105
[INSERT], 124000, 190242.74675324676
[INSERT], 125000, 62657.52589641434
[INSERT], 126000, 54885.42830188679
[INSERT], 127000, 40966.43741588156
[INSERT], 128000, 40186.2807486631
[INSERT], 129000, 54959.426326129666
[INSERT], 130000, 979216.15625
[INSERT], 131000, 70659.34965034966
[INSERT], 132000, 52453.47703180212
[INSERT], 133000, 53741.45617173524
[INSERT], 134000, 48183.72133757962
[INSERT], 135000, 49822.74250440917
[INSERT], 136000, 41930.919165580184
[INSERT], 137000, 49056.21131447588
[INSERT], 138000, 41897.00282087447
[INSERT], 139000, 47781.46884735202
[INSERT], 140000, 56971.11090225564
[INSERT], 141000, 56222.58157389635
[INSERT], 142000, 42810.94957983193
[INSERT], 143000, 43678.28759124088
[INSERT], 144000, 46976.61708860759
[INSERT], 145000, 35862.12755716005
[INSERT], 146000, 36916.97826086957
[INSERT], 147000, 91895.46907216495
[INSERT], 148000, 41861.64887640449
[INSERT], 149000, 49103.41312056738
[INSERT], 150000, 66439.39917695473
[INSERT], 151000, 51851.470085470086
[INSERT], 152000, 48243.85967741936
[INSERT], 153000, 43360.77358490566
[INSERT], 154000, 47076.012738853504
[INSERT], 155000, 243086.631147541
[INSERT], 156000, 76369.21534653465
[INSERT], 157000, 60856.45991561181
[INSERT], 158000, 58815.2226487524
[INSERT], 159000, 48113.09538950715
[INSERT], 160000, 58648.17670682731
[INSERT], 161000, 57919.705103969754
[INSERT], 162000, 46764.99845916795
[INSERT], 163000, 58140.59081836327
[INSERT], 164000, 49842.261788617885
[INSERT], 165000, 70903.75061728395
[INSERT], 166000, 50551.87006578947
[INSERT], 167000, 45154.620790629575
[INSERT], 168000, 45653.05513016845
[INSERT], 169000, 42345.98426323319
[INSERT], 170000, 57348.72762645914
[INSERT], 171000, 53795.249110320285
[INSERT], 172000, 45180.374442793465
[INSERT], 173000, 44735.675344563555
[INSERT], 174000, 42388.13305322129
[INSERT], 175000, 69378.89220183487
[INSERT], 176000, 69124.57534246576
[INSERT], 177000, 49921.016949152545
[INSERT], 178000, 56296.55597014925
[INSERT], 179000, 45287.3186646434
[INSERT], 180000, 41821.79300699301
[INSERT], 181000, 46391.23088685015
[INSERT], 182000, 54465.36347197107
[INSERT], 183000, 42157.64174894217
[INSERT], 184000, 38118.795454545456
[INSERT], 185000, 113484.24505928854
[INSERT], 186000, 82892.09150326798
[INSERT], 187000, 75013.622406639
[INSERT], 188000, 59047.01452282158
[INSERT], 189000, 58269.839252336445
[INSERT], 190000, 50701.150557620815
[INSERT], 191000, 59548.4981884058
[INSERT], 192000, 43097.16905444126
[INSERT], 193000, 42421.775568181816
[INSERT], 194000, 54019.91470054446
[INSERT], 195000, 150979.17964071856
[INSERT], 196000, 105956.41212121212
[INSERT], 197000, 45210.23716012084
[INSERT], 198000, 39703.77176781002
[INSERT], 199000, 66560.32093023256
[INSERT], 200000, 128266.29338842975
[INSERT], 201000, 42819.17171717172
[INSERT], 202000, 44458.46511627907
[INSERT], 203000, 50451.44556113903
[INSERT], 204000, 45956.357142857145
[INSERT], 205000, 71535.83413461539
[INSERT], 206000, 51665.5741056218
[INSERT], 207000, 54379.097605893185
[INSERT], 208000, 49580.376835236544
[INSERT], 209000, 47891.96835443038
[INSERT], 210000, 157325.52173913043
[INSERT], 211000, 50416.27004909984
[INSERT], 212000, 55910.426966292136
[INSERT], 213000, 38362.919642857145
[INSERT], 214000, 47083.034375
[INSERT], 215000, 99794.97101449275
[INSERT], 216000, 634862.0327868853
[INSERT], 217000, 62591.30470347648
[INSERT], 218000, 52257.41446208113
[INSERT], 219000, 54505.01814882032
[INSERT], 220000, 41692.72275862069
[INSERT], 221000, 53260.51675485009
[INSERT], 222000, 46532.52173913043
[INSERT], 223000, 53575.9625
[INSERT], 224000, 56420.871086556166
[INSERT], 225000, 60847.80981595092
[INSERT], 226000, 58893.10982658959
[INSERT], 227000, 40454.99725651577
[INSERT], 228000, 47125.15372670807
[INSERT], 229000, 64002.55838641189
[INSERT], 230000, 82548.99441340783
[INSERT], 231000, 50983.504604051566
[INSERT], 232000, 45359.983216783214
[INSERT], 233000, 44813.78454680535
[INSERT], 234000, 57430.718095238095
[INSERT], 235000, 45444.91007751938
[INSERT], 236000, 43724.77761413844
[INSERT], 237000, 56645.11886792453
[INSERT], 238000, 46174.64705882353
[INSERT], 239000, 44624.485074626864
[INSERT], 240000, 66291.20750551876
[INSERT], 241000, 49714.96302521008
[INSERT], 242000, 39997.736
[INSERT], 243000, 59659.4859437751
[INSERT], 244000, 48815.29073482428
[INSERT], 245000, 79170.35120643432
[INSERT], 246000, 73006.91970802919
[INSERT], 247000, 40954.59594594595
[INSERT], 248000, 45698.09327217125
[INSERT], 249000, 47882.11885895404
[INSERT], 250000, 65927.89737991267
[INSERT], 251000, 49235.067880794704
[INSERT], 252000, 47775.68284789644
[INSERT], 253000, 54452.52762923351
[INSERT], 254000, 54958.08703703704
[INSERT], 255000, 75227.24215246637
[INSERT], 256000, 78903.43438077634
[INSERT], 257000, 44892.16470588235
[INSERT], 258000, 44267.13742690058
[INSERT], 259000, 53698.119047619046
[INSERT], 260000, 69461.925058548
[INSERT], 261000, 39077.365822784814
[INSERT], 262000, 43781.2991202346
[INSERT], 263000, 54039.63537906137
[INSERT], 264000, 52314.19072164949
[INSERT], 265000, 66268.05227272728
[INSERT], 266000, 40446.92493297587
[INSERT], 267000, 50694.71698113208
[INSERT], 268000, 44659.97816593887
[INSERT], 269000, 39859.7107093185
[INSERT], 270000, 54731.377224199285
[INSERT], 271000, 52128.64137931034
[INSERT], 272000, 43620.610951008646
[INSERT], 273000, 52981.17985611511
[INSERT], 274000, 98411.02572347267
[INSERT], 275000, 54154.48101265823
[INSERT], 276000, 42431.625
[INSERT], 277000, 385654.8553459119
[INSERT], 278000, 143920.94144144145
[INSERT], 279000, 49492.283171521034
[INSERT], 280000, 38127.794979079496
[INSERT], 281000, 50210.62480127186
[INSERT], 282000, 53901.56506238859
[INSERT], 283000, 52118.476439790575
[INSERT], 284000, 55426.84078711986
[INSERT], 285000, 57092.502040816325
[INSERT], 286000, 56678.049910873444
[INSERT], 287000, 46448.5905511811
[INSERT], 288000, 40902.68791500664
[INSERT], 289000, 58859.65277777778
[INSERT], 290000, 68370.28211009175
[INSERT], 291000, 66209.02386117137
[INSERT], 292000, 55827.52963671128
[INSERT], 293000, 47001.60223642173
[INSERT], 294000, 56152.518382352944
[INSERT], 295000, 45645.76352705411
[INSERT], 296000, 57739.57827476038
[INSERT], 297000, 48514.3108348135
[INSERT], 298000, 58460.60170940171
[INSERT], 299000, 52808.99246704332
[INSERT], 300000, 60623.016949152545
[INSERT], 301000, 48022.33278418452
[INSERT], 302000, 64670.40756302521
[INSERT], 303000, 47643.445705024315
[INSERT], 304000, 59879.00425531915
[INSERT], 305000, 74065.55324074074
[INSERT], 306000, 46869.728706624606
[INSERT], 307000, 52513.25171232877
[INSERT], 308000, 43323.56565656565
[INSERT], 309000, 46154.488958990536
[INSERT], 310000, 77146.19934640524
[INSERT], 311000, 53030.046242774566
[INSERT], 312000, 46698.515007898895
[INSERT], 313000, 45058.14985163205
[INSERT], 314000, 40389.7698630137
[INSERT], 315000, 123552.00416666667
[INSERT], 316000, 64890.0641025641
[INSERT], 317000, 47148.17619783617
[INSERT], 318000, 46342.812596006144
[INSERT], 319000, 49246.10613598673
[INSERT], 320000, 57666.45306122449
[INSERT], 321000, 58793.57757009346
[INSERT], 322000, 47272.46543778802
[INSERT], 323000, 46898.91387559809
[INSERT], 324000, 55529.53798767967
[INSERT], 325000, 87209.1961852861
[INSERT], 326000, 64991.913043478264
[INSERT], 327000, 160912.52090032154
[INSERT], 328000, 50631.01184433164
[INSERT], 329000, 54817.83512544803
[INSERT], 330000, 68765.37122969837
[INSERT], 331000, 45103.522
[INSERT], 332000, 91254.25552825553
[INSERT], 333000, 54443.77321428571
[INSERT], 334000, 48026.460063897764
[INSERT], 335000, 58884.2945368171
[INSERT], 336000, 61347.54340277778
[INSERT], 337000, 43588.93392070485
[INSERT], 338000, 46290.25
[INSERT], 339000, 69804.6995967742
[INSERT], 340000, 58032.15
[INSERT], 341000, 64379.56756756757
[INSERT], 343000, 302983.0044843049
[INSERT], 344000, 48644.00327332242
[INSERT], 345000, 41588.16182572614
[INSERT], 346000, 74806.43920595534
[INSERT], 347000, 56733.8932038835
[INSERT], 348000, 52698.32638888889
[INSERT], 349000, 43311.45596590909
[INSERT], 350000, 48291.33498349835
[INSERT], 351000, 81862.13636363637
[INSERT], 352000, 41553.64615384615
[INSERT], 353000, 54973.91328413284
[INSERT], 354000, 45195.21699544765
[INSERT], 355000, 42136.35220994475
[INSERT], 356000, 41094.58956276446
[INSERT], 357000, 50511.860162601624
[INSERT], 358000, 57593.52559055118
[INSERT], 359000, 50718.23305785124
[INSERT], 360000, 40373.627586206894
[INSERT], 361000, 57919.49236641221
[INSERT], 362000, 134238.38248847926
[INSERT], 363000, 56890.8202247191
[INSERT], 364000, 55374.84864864865
[INSERT], 365000, 49908.499159663865
[INSERT], 366000, 55042.554128440366
[INSERT], 367000, 62720.871848739494
[INSERT], 368000, 43525.95953757226
[INSERT], 369000, 43344.31746031746
[INSERT], 370000, 42282.26762589928
[INSERT], 371000, 44164.39929947461
[INSERT], 372000, 66559.82251908397
[INSERT], 373000, 44812.85451761103
[INSERT], 374000, 47570.456355283306
[INSERT], 375000, 48130.78913738019
[INSERT], 376000, 47669.84394904459
[INSERT], 377000, 100525.06785714286
[INSERT], 378000, 62133.359840954276
[INSERT], 379000, 58058.61923076923
[INSERT], 380000, 56190.82584269663
[INSERT], 381000, 41024.93672627235
[INSERT], 382000, 49668.47394136808
[INSERT], 383000, 43998.54285714286
[INSERT], 384000, 54065.94830659537
[INSERT], 385000, 47422.79491255962
[INSERT], 386000, 43873.06956521739
[INSERT], 387000, 53193.10638297872
[INSERT], 388000, 49399.88344594595
[INSERT], 389000, 100172.9633027523
[INSERT], 390000, 421714.2584269663
[INSERT], 391000, 77211.35483870968
[INSERT], 392000, 47347.30136986302
[INSERT], 393000, 124276.41216216216
[INSERT], 394000, 573657.393442623
[INSERT], 395000, 280623.78306878306
[INSERT], 396000, 46944.3225308642
[INSERT], 397000, 42120.35539568345
[INSERT], 398000, 54293.671428571426
[INSERT], 399000, 56812.778195488725
[INSERT], 400000, 44121.2023988006
[INSERT], 401000, 48141.199044585985
[INSERT], 402000, 47059.91637010676
[INSERT], 403000, 141074.17222222223
[INSERT], 404000, 153309.13402061857
[INSERT], 405000, 131685.03217821784
[INSERT], 406000, 47183.35905511811
[INSERT], 407000, 46937.88106416276
[INSERT], 408000, 60418.75523012552
[INSERT], 409000, 150235.6326530612
[INSERT], 410000, 444289.8939393939
[INSERT], 411000, 78778.42716049383
[INSERT], 412000, 47692.59083728278
[INSERT], 413000, 50168.333333333336
[INSERT], 414000, 124028.54228855722
[INSERT], 415000, 105920.84939759035
[INSERT], 416000, 68898.12971698113
[INSERT], 417000, 55316.936594202896
[INSERT], 418000, 76706.83713355049
[INSERT], 419000, 73917.0745967742
[INSERT], 420000, 61210.19269776876
[INSERT], 421000, 51844.54255319149
[INSERT], 422000, 49555.49918699187
[INSERT], 423000, 56711.721804511275
[INSERT], 424000, 51455.498207885306
[INSERT], 425000, 67450.23093681918
[INSERT], 426000, 48077.82408874802
[INSERT], 427000, 94546.08598726115
[INSERT], 428000, 66075.04565217391
[INSERT], 429000, 57531.27226463104
[INSERT], 430000, 74927.38922155689
[INSERT], 431000, 49528.16112956811
[INSERT], 432000, 47988.304487179485
[INSERT], 433000, 56243.99424184261
[INSERT], 434000, 41814.271844660194
[INSERT], 435000, 105649.00357142858
[INSERT], 436000, 42140.198087431694
[INSERT], 437000, 43840.283211678834
[INSERT], 438000, 49453.35294117647
[INSERT], 439000, 55971.4934086629
[INSERT], 440000, 47720.07082630692
[INSERT], 441000, 57518.189964157704
[INSERT], 442000, 43497.65462427746
[INSERT], 443000, 41803.41495601173
[INSERT], 444000, 62175.15983606558
[INSERT], 445000, 58860.388535031845
[INSERT], 446000, 57324.23423423423
[INSERT], 447000, 50237.290322580644
[INSERT], 448000, 44193.529753265604
[INSERT], 449000, 48908.48275862069
[INSERT], 450000, 66220.35990888382
[INSERT], 451000, 46362.962797619046
[INSERT], 452000, 48856.4657980456
[INSERT], 453000, 52531.441941074525
[INSERT], 454000, 71274.73975903615
[INSERT], 455000, 86547.82890855457
[INSERT], 456000, 62412.4659400545
[INSERT], 457000, 90424.25714285714
[INSERT], 458000, 248058.65934065933
[INSERT], 459000, 57789.492452830185
[INSERT], 460000, 45118.925278219394
[INSERT], 461000, 73721.67385444744
[INSERT], 462000, 72471.5668789809
[INSERT], 463000, 74465.37055837564
[INSERT], 464000, 59027.938814531546
[INSERT], 465000, 63547.352688172046
[INSERT], 466000, 46219.163833075734
[INSERT], 467000, 78860.84776902887
[INSERT], 468000, 49684.45799011532
[INSERT], 469000, 46467.011884550084
[INSERT], 470000, 143965.15846994537
[INSERT], 471000, 538708.4285714285
[INSERT], 472000, 86355.9226519337
[INSERT], 473000, 57239.76666666667
[INSERT], 474000, 345629.7604790419
[INSERT], 475000, 65111.854800936766
[INSERT], 476000, 73083.92990654205
[INSERT], 477000, 44647.307692307695
[INSERT], 478000, 50974.26506024096
[INSERT], 479000, 45817.065648854965
[INSERT], 480000, 60745.456
[INSERT], 481000, 46425.3643533123
[INSERT], 482000, 44118.50581395349
[INSERT], 483000, 73221.00246305419
[INSERT], 484000, 40874.13458950202
[INSERT], 485000, 50227.16245487364
[INSERT], 486000, 54537.5
[INSERT], 487000, 53858.34375
[INSERT], 488000, 46833.80634920635
[INSERT], 489000, 75243.70979020979
[INSERT], 490000, 143161.45054945056
[INSERT], 491000, 48563.01075268817
[INSERT], 492000, 65029.15863453815
[INSERT], 493000, 46790.24615384615
[INSERT], 494000, 69279.32476635514
[INSERT], 495000, 55102.98095238095
[INSERT], 496000, 68042.9649122807
[INSERT], 497000, 54475.93078324226
[INSERT], 498000, 47994.00157480315
[INSERT], 499000, 70280.10778443114
[INSERT], 500000, 101060.36647727272
[INSERT], 501000, 75530.89168765744
[INSERT], 502000, 73158.41646489104
[INSERT], 503000, 42145.931276297335
[INSERT], 504000, 98966.27
[INSERT], 505000, 46730.06331168831
[INSERT], 506000, 73990.76728110599
[INSERT], 507000, 55505.13034623218
[INSERT], 508000, 48735.672106824924
[INSERT], 509000, 39089.704268292684
[INSERT], 510000, 78890.05977011494
[INSERT], 511000, 40453.53908355795
[INSERT], 512000, 52172.175958188156
[INSERT], 513000, 45615.20583717358
[INSERT], 514000, 48791.13166666667
[INSERT], 515000, 49548.8081300813
[INSERT], 516000, 53451.53262786596
[INSERT], 517000, 53663.782688766114
[INSERT], 518000, 51017.86394557823
[INSERT], 519000, 46730.60665658094
[INSERT], 520000, 47865.51036682616
[INSERT], 521000, 51216.565217391304
[INSERT], 522000, 51016.538590604025
[INSERT], 523000, 56927.412109375
[INSERT], 524000, 48357.969793322736
[INSERT], 525000, 46655.329493087556
[INSERT], 526000, 1208076.5
[INSERT], 527000, 173452.2467866324
[INSERT], 528000, 44453.33736762481
[INSERT], 529000, 55673.18426103647
[INSERT], 530000, 95342.71597633135
[INSERT], 531000, 49298.778730703256
[INSERT], 532000, 55652.06222222222
[INSERT], 533000, 74557.73036093418
[INSERT], 534000, 49802.79836065574
[INSERT], 535000, 50052.1568627451
[INSERT], 536000, 189397.58483754512
[INSERT], 537000, 52826.43090909091
[INSERT], 538000, 65472.935760171305
[INSERT], 539000, 45607.56982343499
[INSERT], 540000, 66974.94904458598
[INSERT], 541000, 58057.81728880157
[INSERT], 542000, 85911.63126843658
[INSERT], 543000, 83983.66788321167
[INSERT], 544000, 79954.61157024793
[INSERT], 545000, 50451.22487223169
[INSERT], 546000, 51119.096505823625
[INSERT], 547000, 56844.56106870229
[INSERT], 548000, 60315.78085106383
[INSERT], 549000, 51093.31746031746
[INSERT], 550000, 51466.697715289985
[INSERT], 551000, 53301.15601023018
[INSERT], 552000, 120165.6418918919
[INSERT], 553000, 47601.85519591141
[INSERT], 554000, 59163.004385964916
[INSERT], 555000, 52544.82178217822
[INSERT], 556000, 54668.13100436681
[INSERT], 557000, 84864.55799373041
[INSERT], 558000, 42644.276666666665
[INSERT], 559000, 42573.5989010989
[INSERT], 560000, 71468.0959752322
[INSERT], 561000, 59503.2
[INSERT], 562000, 77600.62204724409
[INSERT], 563000, 38124.395638629285
[INSERT], 564000, 65807.68421052632
[INSERT], 565000, 65220.36666666667
[INSERT], 566000, 41504.142857142855
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 312.03333333333336
[CLEANUP], MinLatency(us), 170
[CLEANUP], MaxLatency(us), 1003
[CLEANUP], 0, 1003.0
[CLEANUP], 3000, 813.0
[CLEANUP], 5000, 331.0
[CLEANUP], 8000, 268.0
[CLEANUP], 10000, 184.0
[CLEANUP], 11000, 237.5
[CLEANUP], 12000, 238.5
[CLEANUP], 13000, 451.0
[CLEANUP], 14000, 274.0
[CLEANUP], 15000, 213.66666666666666
[CLEANUP], 16000, 304.5
[CLEANUP], 17000, 232.0
[CLEANUP], 18000, 201.5
java -cp /root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/jdbc/target/jdbc-binding-0.1.4.jar:/root/ycsb/YCSB/jdbc/target/archive-tmp/jdbc-binding-0.1.4.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.JdbcDBClient -P /root/ycsb/config/postgresql.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load